org/roam/openwrt.org
:PROPERTIES:
:ID:       18ebc285-c771-4420-a040-011fd3b96b51
:END:
#+title: openwrt
#+OPTIONS: toc:nil num:nil date:nil \n:nil html-style:nil author:nil timestamp:nil title:nil html-postamble:nil html5-fancy:t
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org-default.css" />
#+HTML_CONTENT_CLASS: container
#+HTML_DOCTYPE: html5
#+INCLUDE: "css.org::navbar" :only-contents t
* Openwrt
a os for my routers
** LINKSYS EA6500v2
- official firmware beyond 1.1.40.166281 check signing and rollback is only 1 version
  - rollback via tftp
    - disable network manager
    - set 192.168.1.2 for tftp server and client of 192.168.1.1
      - ~ip addr add 192.168.1.2/24 dev enp0s25~
      - ~arp -s 192.168.1.1 MA:CA:DD:RR:ES:SS~
    - flash older firmware then flash openwrt via web interface
    - tftp.exe from linksys needs ~winetricks mfc42~ with wine 7.7
      - need linksys tftp client as they use a nonstandard password
        - router does not allow empty password
    - flashes the 'rollback' firmware

** TP-LINK Archer AC 1750 v2
- region coded firmware (us version)

** Linksys 6500RE
- default bootloader password 1234567890
- set tftp server ip to 192.168.1.100
- disable ~dnsmasq~ dns and set tftp-root
- disable firewall for tftp
- failed to boot 23.05.0
  - used 23.03.1 (roll forward?)

** Wireless Repeater
- https://openwrt.org/docs/guide-user/network/wifi/relay_configuration
- disable dhcp interface on lan and ipv6 ra-service/dhcp-v6 service
- One radio connected as client
  - lan firewall rules and wwan default
- set the lan default gateway to that of the client
- One radio access point
- install luci-proto-relay after updating package list then reboot
- add bridge interface between the two networks

*** asu
- builds update image from server with packages and saves config when updating
- ~luci-app-attendedsysupgrade~ offers a simple tool under System (Attended Sysupgrade)

*** travelmate
- install package and configure for AP and client
