docs/openwrt.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>openwrt</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container content">
<nav class="navbar is-black" id="orgf161cfd">
<div class="navbar-brand" id="org093ecaa">
<div class="navbar-item" id="orgbcbde6e">
<p>
<a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a>
</p>

</div>

</div>
<div class="navbar-menu" id="org9d48c61">
<div class="navbar-start" id="org41fe241">
<div class="navbar-item" id="org1ae37cf">
<p>
<a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a>
</p>

</div>

</div>
<div class="navbar-end" id="orgffec6b5">

</div>

</div>
</nav>
<div id="outline-container-org44ba3f4" class="outline-2">
<h2 id="org44ba3f4">Openwrt</h2>
<div class="outline-text-2" id="text-org44ba3f4">
<p>
a os for my routers
</p>
</div>
<div id="outline-container-org84093ba" class="outline-3">
<h3 id="org84093ba">LINKSYS EA6500v2</h3>
<div class="outline-text-3" id="text-org84093ba">
<ul class="org-ul">
<li>official firmware beyond 1.1.40.166281 check signing and rollback is only 1 version
<ul class="org-ul">
<li>rollback via tftp
<ul class="org-ul">
<li>disable network manager</li>
<li>set 192.168.1.2 for tftp server and client of 192.168.1.1
<ul class="org-ul">
<li><code>ip addr add 192.168.1.2/24 dev enp0s25</code></li>
<li><code>arp -s 192.168.1.1 MA:CA:DD:RR:ES:SS</code></li>
</ul></li>
<li>flash older firmware then flash openwrt via web interface</li>
<li>tftp.exe from linksys needs <code>winetricks mfc42</code> with wine 7.7
<ul class="org-ul">
<li>need linksys tftp client as they use a nonstandard password
<ul class="org-ul">
<li>router does not allow empty password</li>
</ul></li>
</ul></li>
<li>flashes the 'rollback' firmware</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgce4d009" class="outline-3">
<h3 id="orgce4d009">TP-LINK Archer AC 1750 v2</h3>
<div class="outline-text-3" id="text-orgce4d009">
<ul class="org-ul">
<li>region coded firmware (us version)</li>
</ul>
</div>
</div>

<div id="outline-container-org489683a" class="outline-3">
<h3 id="org489683a">Linksys 6500RE</h3>
<div class="outline-text-3" id="text-org489683a">
<ul class="org-ul">
<li>default bootloader password 1234567890</li>
<li>set tftp server ip to 192.168.1.100</li>
<li>disable dnsmasq dns and set tftp-root</li>
<li>disable firewall for tftp</li>
<li>failed to boot 23.05.0
<ul class="org-ul">
<li>used 23.03.1 (roll forward?)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orge633892" class="outline-3">
<h3 id="orge633892">Wireless Repeater</h3>
<div class="outline-text-3" id="text-orge633892">
<ul class="org-ul">
<li><a href="https://openwrt.org/docs/guide-user/network/wifi/relay_configuration">https://openwrt.org/docs/guide-user/network/wifi/relay_configuration</a></li>
<li>disable dhcp interface on lan and ipv6 ra-service/dhcp-v6 service</li>
<li>One radio connected as client
<ul class="org-ul">
<li>lan firewall rules and wwan default</li>
</ul></li>
<li>set the lan default gateway to that of the client</li>
<li>One radio access point</li>
<li>install luci-proto-relay after updating package list then reboot</li>
<li>add bridge interface between the two networks</li>
</ul>
</div>

<div id="outline-container-org545e4a1" class="outline-4">
<h4 id="org545e4a1">asu</h4>
<div class="outline-text-4" id="text-org545e4a1">
<ul class="org-ul">
<li>builds update image from server with packages and saves config when updating</li>
<li><code>luci-app-attendedsysupgrade</code> offers a simple tool under System (Attended Sysupgrade)</li>
</ul>
</div>
</div>

<div id="outline-container-org1cad4bc" class="outline-4">
<h4 id="org1cad4bc">travelmate</h4>
<div class="outline-text-4" id="text-org1cad4bc">
<ul class="org-ul">
<li>install package and configure for AP and client</li>
</ul>
</div>
</div>
</div>
</div>
</div>
</body>
</html>